using Spectre.Console;
//using StaticCredentialCheck;

#region StartupTasks
// Clearscreen and Welcome message using Spectre.Console
AnsiConsole.Clear();
AnsiConsole.Write(new Panel("[gray]Challenge 2.1: Switch Ranges, UserID & Password[/]").BorderColor(Color.MediumVioletRed));
#endregion





// Challenge 2.1 ///////////////////////////////////////////////////////////////////////
//
//          █████                ████  ████                                            ████████     ████ 
//         ░░███                ░░███ ░░███                                           ███░░░░███   ░░███ 
//  ██████  ░███████    ██████   ░███  ░███   ██████  ████████    ███████  ██████    ░░░    ░███    ░███ 
// ███░░███ ░███░░███  ░░░░░███  ░███  ░███  ███░░███░░███░░███  ███░░███ ███░░███      ███████     ░███ 
//░███ ░░░  ░███ ░███   ███████  ░███  ░███ ░███████  ░███ ░███ ░███ ░███░███████      ███░░░░      ░███ 
//░███  ███ ░███ ░███  ███░░███  ░███  ░███ ░███░░░   ░███ ░███ ░███ ░███░███░░░      ███      █    ░███ 
//░░██████  ████ █████░░████████ █████ █████░░██████  ████ █████░░███████░░██████    ░██████████ ██ █████
// ░░░░░░  ░░░░ ░░░░░  ░░░░░░░░ ░░░░░ ░░░░░  ░░░░░░  ░░░░ ░░░░░  ░░░░░███ ░░░░░░     ░░░░░░░░░░ ░░ ░░░░░ 
//                                                               ███ ░███                                
//                                                              ░░██████                                 
//                                                               ░░░░░░                                  
#region Challenge_2_1 
AnsiConsole.MarkupLine("\n[bold magenta]Challenge 2.1 - Temperature calculator[/]\n");

// step 1: get temp in farenheit
int tempFarenheit = AnsiConsole.Prompt(
    new TextPrompt<int>("Enter the temperature in Farenheit: ")
        .PromptStyle("yellow")
        .ValidationErrorMessage("[red]Invalid entry.[/] Must be a valid integer number.")
);
string description = tempFarenheit switch
{
    < 0 => "below freezing", // would be correct for Celsius (0) not Farenheit (32), but for the sake of this exercise...
    >= 0 and <= 10 => "Freezing",
    > 10 and <= 20 => "Very Cold",
    > 20 and <= 35 => "Cold",
    > 35 and <= 50 => "Normal",
    > 50 and <= 65 => "Hot",
    > 65 and <= 80 => "Very Hot",
    > 80 => "Too Hot"
};
AnsiConsole.MarkupLine($"\n[bold green] It's[/] [bold black on white]{description}[/] [bold green]weather out![/]\n");

#endregion
// Challenge_2_1 ///////////////////////////////////////////////////////////////////////





// Challenge 2.2 ///////////////////////////////////////////////////////////////////////
//
//          █████                ████  ████                                            ████████      ████████ 
//         ░░███                ░░███ ░░███                                           ███░░░░███    ███░░░░███
//  ██████  ░███████    ██████   ░███  ░███   ██████  ████████    ███████  ██████    ░░░    ░███   ░░░    ░███
// ███░░███ ░███░░███  ░░░░░███  ░███  ░███  ███░░███░░███░░███  ███░░███ ███░░███      ███████       ███████ 
//░███ ░░░  ░███ ░███   ███████  ░███  ░███ ░███████  ░███ ░███ ░███ ░███░███████      ███░░░░       ███░░░░  
//░███  ███ ░███ ░███  ███░░███  ░███  ░███ ░███░░░   ░███ ░███ ░███ ░███░███░░░      ███      █    ███      █
//░░██████  ████ █████░░████████ █████ █████░░██████  ████ █████░░███████░░██████    ░██████████ ██░██████████
// ░░░░░░  ░░░░ ░░░░░  ░░░░░░░░ ░░░░░ ░░░░░  ░░░░░░  ░░░░ ░░░░░  ░░░░░███ ░░░░░░     ░░░░░░░░░░ ░░ ░░░░░░░░░░ 
//                                                               ███ ░███                                     
//                                                              ░░██████                                      
//                                                               ░░░░░░                                       
//                                                                                                            
#region Challenge_2_2
AnsiConsole.MarkupLine("\n[bold magenta]Challenge 2.2 - UserID and Password Input[/]\n");


if (CredentialCheck.ResetCredentials()) // define credentials for testing VerifyCredentials functionality
{
    if (CredentialCheck.VerifyCredentials())
    {
        Console.ForegroundColor = ConsoleColor.Green;
        Console.WriteLine("\nSucccesful logon.");
    }
    else
    {
        Console.ForegroundColor = ConsoleColor.Red;
        Console.WriteLine("\nToo many attempts - blocked.");
    }
    Console.ResetColor();
}
//Console.ReadLine(); 

#endregion
// Challenge 2.2 ///////////////////////////////////////////////////////////////////////





#region ShutdownTasks
// ------------------------------------------------------------------------
// End of Code, wait for user to press enter, and clear background
Console.ReadLine();
AnsiConsole.Clear();
//
#endregion
